; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Warehouse
;
; By: Ryan Xiao Wang, 2024
; License: MIT
;
; The aim is to move remove exactly the boxes that are marked for removal.
; Boxes start on stacks of blocks that are located on a fixed number of bases,
; and can be moved between stacks and bases. Boxes can be removed from the
; stacks and bases they are on when they are the top box.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain warehouse)
    (:requirements :strips :typing :equality)
    (:types box base) 
    (:predicates 
        (on ?b1 - box ?b2 - box)
        (on-base ?b - box ?base - base)
        (clear ?b - box)
        (clear-base ?b - base)
        (to-remove ?b - box)
        (removed ?b - box)
    )

    (:action move
        :parameters (?b ?old-under ?new-under - box)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-to-new-base
        :parameters (?b ?old-under - box ?new-base - base)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear-base ?new-base)
        )
        :effect (and 
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-from-base
        :parameters (?b - box ?base - base ?new-under - box)
        :precondition (and
            (clear ?b)
            (on-base ?b ?base)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear-base ?base)
            (not (on-base ?b ?base))
        )
    )

    (:action move-between-base
        :parameters (?b - box ?old-base ?new-base - base)
        :precondition (and
            (clear ?b)
            (on-base ?b ?old-base)
            (clear-base ?new-base)
        )
        :effect (and
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear-base ?old-base)
            (not (on-base ?b ?old-base))
        )
    )

    (:action remove
        :parameters (?b ?under - box)
        :precondition (and
            (to-remove ?b)
            (on ?b ?under)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear ?under)
            (not (on ?b ?under))
            (not (clear ?b))
        )
    )

    (:action remove-from-base
        :parameters (?b - box ?base - base)
        :precondition (and
            (to-remove ?b)
            (on-base ?b ?base)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear-base ?base)
            (not (on-base ?b ?base))
            (not (clear ?b))
        )
    )
)

; problem
;; boxes=52, remove_proportion=0.101, bases=20, instance_id=15, output=./training, seed=56

(define (problem warehouse-15)
    (:domain warehouse)
    (:objects
        box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 box24 box25 box26 box27 box28 box29 box30 box31 box32 box33 box34 box35 box36 box37 box38 box39 box40 box41 box42 box43 box44 box45 box46 box47 box48 box49 box50 box51 box52 - box
        base1 base2 base3 base4 base5 base6 base7 base8 base9 base10 base11 base12 base13 base14 base15 base16 base17 base18 base19 base20 - base
    )
    (:init
        (to-remove box1)
        (to-remove box31)
        (to-remove box34)
        (to-remove box36)
        (to-remove box42)
        (clear box49)
        (on box49 box21)
        (on box21 box45)
        (on box45 box13)
        (on box13 box51)
        (on-base box51 base1)
        (clear box16)
        (on box16 box46)
        (on-base box46 base2)
        (clear box8)
        (on box8 box35)
        (on-base box35 base3)
        (clear box5)
        (on box5 box26)
        (on-base box26 base4)
        (clear box41)
        (on box41 box22)
        (on box22 box19)
        (on box19 box34)
        (on-base box34 base5)
        (clear box32)
        (on box32 box25)
        (on box25 box38)
        (on box38 box40)
        (on-base box40 base6)
        (clear box12)
        (on box12 box28)
        (on box28 box30)
        (on box30 box36)
        (on box36 box15)
        (on box15 box39)
        (on-base box39 base7)
        (clear box24)
        (on box24 box4)
        (on-base box4 base8)
        (clear box10)
        (on-base box10 base9)
        (clear box1)
        (on-base box1 base10)
        (clear box9)
        (on-base box9 base11)
        (clear box44)
        (on box44 box48)
        (on box48 box6)
        (on-base box6 base12)
        (clear box33)
        (on box33 box20)
        (on box20 box23)
        (on-base box23 base13)
        (clear box3)
        (on-base box3 base14)
        (clear box31)
        (on-base box31 base15)
        (clear box43)
        (on-base box43 base16)
        (clear box37)
        (on box37 box52)
        (on-base box52 base17)
        (clear box18)
        (on box18 box29)
        (on box29 box2)
        (on box2 box42)
        (on-base box42 base18)
        (clear box14)
        (on box14 box50)
        (on box50 box47)
        (on box47 box17)
        (on box17 box11)
        (on-base box11 base19)
        (clear box27)
        (on box27 box7)
        (on-base box7 base20)
    )
    (:goal (and 
        (removed box1)
        (removed box31)
        (removed box34)
        (removed box36)
        (removed box42)
    ))
)

; plan
1. (remove-from-base box1 base10)
   deleted: (on-base box1 base10) (clear box1)
   added: (removed box1) (clear-base base10)
   goals met: 1 of 5
2. (move box12 box28 box10)
   deleted: (clear box10) (on box12 box28)
   added: (on box12 box10) (clear box28)
   goals met: 1 of 5
3. (move box18 box29 box12)
   deleted: (clear box12) (on box18 box29)
   added: (on box18 box12) (clear box29)
   goals met: 1 of 5
4. (move box28 box30 box14)
   deleted: (clear box14) (on box28 box30)
   added: (on box28 box14) (clear box30)
   goals met: 1 of 5
5. (move box29 box2 box16)
   deleted: (clear box16) (on box29 box2)
   added: (on box29 box16) (clear box2)
   goals met: 1 of 5
6. (move box2 box42 box18)
   deleted: (clear box18) (on box2 box42)
   added: (on box2 box18) (clear box42)
   goals met: 1 of 5
7. (move box30 box36 box2)
   deleted: (clear box2) (on box30 box36)
   added: (on box30 box2) (clear box36)
   goals met: 1 of 5
8. (move box41 box22 box24)
   deleted: (clear box24) (on box41 box22)
   added: (on box41 box24) (clear box22)
   goals met: 1 of 5
9. (move box22 box19 box27)
   deleted: (clear box27) (on box22 box19)
   added: (on box22 box27) (clear box19)
   goals met: 1 of 5
10. (move box19 box34 box22)
   deleted: (clear box22) (on box19 box34)
   added: (on box19 box22) (clear box34)
   goals met: 1 of 5
11. (remove-from-base box31 base15)
   deleted: (on-base box31 base15) (clear box31)
   added: (removed box31) (clear-base base15)
   goals met: 2 of 5
12. (remove-from-base box34 base5)
   deleted: (on-base box34 base5) (clear box34)
   added: (removed box34) (clear-base base5)
   goals met: 3 of 5
13. (remove box36 box15)
   deleted: (on box36 box15) (clear box36)
   added: (removed box36) (clear box15)
   goals met: 4 of 5
14. (remove-from-base box42 base18)
   deleted: (on-base box42 base18) (clear box42)
   added: (removed box42) (clear-base base18)
   goals met: 5 of 5
